---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridEndSegmentsLengthTooShort
source: html/8c229f99-e150-204b-1537-53dca8322baa.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridEndSegmentsLengthTooShort Property

The end segment length for a grid must be at least [Length Value]

## Syntax (C#)
```csharp
public static FailureDefinitionId GridEndSegmentsLengthTooShort { get; }
```